8.0/TestEnvironment/Messages/sendOrder_sugres.xml

<?xml version="1.0" encoding="UTF-8"?>
<SOAP-ENV:Envelope xmlns:SOAP-ENV="http://schemas.xmlsoap.org/soap/envelope/" xmlns:SOAP-ENC="http://schemas.xmlsoap.org/soap/encoding/" xmlns:xsi="http://www.w3.org/2001/XMLSchema-instance" xmlns:xsd="http://www.w3.org/2001/XMLSchema" xmlns:m0="http://www.esa.int/xml/schemas/mass/aoifeatures" xmlns:m1="http://www.opengis.net/gml" xmlns:m2="http://www.w3.org/1999/xlink" xmlns:m3="http://earth.esa.int/XML/eoli" xmlns:m4="http://www.esa.int/oi">
	<SOAP-ENV:Header>
		<ns1:MessageID xmlns:ns1="http://schema.xml.org/ws/2003/03/addressing">bpel://local/default/NPPBasicOrdergfFlow~1.0/203-BpInv0-dfBpSeq0.3-3</ns1:MessageID>
		<ns2:ReplyTo xmlns:ns2="http://schemas.xmlsoap.org/ws/2003/03/addressing">
			<ns2:Address>http://192.168.24.188:8081/TOOLBOX/Push</ns2:Address>
			<ns2:PortType xmlns:ns3="http://www.vito.be/wsdl/NPPBasic">ns3:NPPBasicServiceCallback</ns2:PortType>
			<ns2:ServiceName xmlns:ns4="http://www.vito.be/wsdl/NPPBasic">ns4:NPPBasicServiceCallbackService</ns2:ServiceName>
		</ns2:ReplyTo>
	</SOAP-ENV:Header>
	<SOAP-ENV:Body>
		<sendOrderInputMsg xmlns="http://www.gim.com/ws/sugres" xmlns:aoi="http://www.esa.int/xml/schemas/mass/aoifeatures" xmlns:eoli="http://earth.esa.int/XML/eoli" xmlns:gml="http://www.opengis.net/gml" xmlns:mass="http://www.esa.int/mass" xmlns:oi="http://www.esa.int/oi" xmlns:sns="http://www.gim.com/ws/sugres">
			<commonInput xmlns="http://www.esa.int/mass">
				<orderId>AAAAAOOOOOSSSS</orderId>
			</commonInput>
			<sendRFQInput>
				<productType/>
				<outputFormat>SHAPE</outputFormat>
				<coordinateSystem>Belgium1972</coordinateSystem>
				<clipRegion>
					<areaOfInterest xmlns="http://www.esa.int/xml/schemas/mass/aoifeatures" xmlns:xsi="http://www.w3.org/2001/XMLSchema-instance" xsi:schemaLocation="http://www.esa.int/xml/schemas/mass/aoifeatures http://services.eoportal.org/schemas/1.3draft/aoifeatures.xsd">
						<boundedBy xmlns="http://www.opengis.net/gml">
							<Box srsName="EPSG:4326">
								<coordinates>12.2101,29.1466 54.7484,61.4442</coordinates>
							</Box>
						</boundedBy>
						<featureMember xmlns="http://www.opengis.net/gml">
							<Feature xmlns="http://www.esa.int/xml/schemas/mass/aoifeatures">
								<boundedBy xmlns="http://www.opengis.net/gml">
									<Box srsName="EPSG:4326">
										<coordinates>12.2101,29.1466 54.7484,61.4442</coordinates>
									</Box>
								</boundedBy>
								<Geometry>
									<Polygon xmlns="http://www.opengis.net/gml" srsName="EPSG:4326">
										<outerBoundaryIs>
											<LinearRing>
												<coordinates>12.2101,29.1466 12.2101,61.4442 54.7484,61.4442 54.7484,29.1466 12.2101,29.1466</coordinates>
											</LinearRing>
										</outerBoundaryIs>
									</Polygon>
								</Geometry>
							</Feature>
						</featureMember>
					</areaOfInterest>
				</clipRegion>
				<date>--</date>
				<userInfo>
					<userId>hmasp</userId>
					<firstName>hma</firstName>
					<lastName>hma</lastName>
					<invoiceAddress/>
					<city>Hoeilaart</city>
					<state>brabant</state>
					<country>BEL</country>
					<emailAddress>marc.gilles@spacebel.be</emailAddress>
					<telNumber>32 0 2 658 20 11</telNumber>
					<faxNumber>32 0 2 658 20 11</faxNumber>
				</userInfo>
			</sendRFQInput>
			<rfqOutput>
				<id xmlns="http://www.esa.int/mass">10</id>
				<price xmlns="http://www.esa.int/mass">
					<refCurrency xmlns="http://www.esa.int/oi">EUR</refCurrency>
					<refAmount xmlns="http://www.esa.int/oi">3</refAmount>
				</price>
				<area>d</area>
				<validityPeriod>April 13, 2006 5:23:07 PM CEST</validityPeriod>
			</rfqOutput>
			<sendOrderInput/>
		</sendOrderInputMsg>
	</SOAP-ENV:Body>
</SOAP-ENV:Envelope>
